---
type: StructuralSectionGeneralW
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralSectionGeneralW

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralW | 2018 | `public StructuralSectionGeneralW ( double width , double height , double flangeThickness , double webThickness , double webFillet , double flangeFillet , double topWebFillet , double centroidHorizontal , double centroidV` |
| Property | FlangeFillet | 2018 | `public double FlangeFillet { get ; set ; }` |
| Property | TopWebFillet | 2018 | `public double TopWebFillet { get ; set ; }` |